export default {
    lang: 'English',

    home: 'الرئيسية',
    categories: 'الأقسام',
    contact: 'تواصل معنا',
    about: 'من نحن',

    part: 'الجزء رقم ',
    sp1: 'استخدم واجهة برمجة تطبيقات Strapi المقدمة من التقييم لنشر بيانات المستخدم في متجر Redux الخاص بك. يجب عليك إضافة مستخدم واحد إلى مجموعة "المستخدمين" وعرض هذه البيانات في جدول باستخدام طلب GET. تأكد من تنفيذ Redux لإدارة الحالة، بما في ذلك طلبات POST لإضافة مستخدم وطلبات GET لعرض البيانات في الجدول.',
    sp2: 'قم بتنفيذ الخريطة باستخدام أي مكتبة من اختيارك (يوصى باستخدام Leaflet). ابحث عن إحداثيات "شركة Digifly" على خرائط Google، ثم ضع تلميحًا على هذه الإحداثيات. تأكد من أن تصميم تلميح الأدوات يتطابق مع التصميم المقدم أدناه.',
    sp3: 'قم بتنفيذ محرر نصوص يكرر أنماط واجهة المستخدم المتوفرة بدقة. من الضروري إنشاء وظيفتي التراجع والإعادة من البداية، بالإضافة إلى ميزتين إضافيتين من اختيارك. يمكنك استخدام أي حزمة، ولكن إنشاء هذه الوظائف من البداية سيكون مفيدًا. تأكد من أن جميع وظائف محرر النصوص قيد التشغيل.',

    footerp1: 'جميع الحقوق محفوظة',
    footerp2: 'ديجي فلاي 2024',

    fn: 'الإسم الأول',
    ln: 'الإسم الأخير',
    mn: 'رقم الموبايل',
    em: 'البريد الإلكترونى',
    snd: 'إرسال',
    res: 'النتائج :',
}


